{
  "name": "The Best, Easiest Focaccia Bread Recipe",
  "servings": 2,
  "prep_time": "18h",
  "cook_time": "30m",
  "total_time": "18h 30m",
  "ingredients": [
    {
      "quantity": 4.0,
      "unit": "cups",
      "item": "(512 g) all-purpose flour or bread flour, see notes above"
    },
    {
      "quantity": 2.0,
      "unit": null,
      "item": "to 3 teaspoons (10 to 15 grams) kosher salt, see notes above"
    },
    {
      "quantity": 2.0,
      "unit": "teaspoons",
      "item": "(8 g) instant yeast, see notes above if using active dry"
    },
    {
      "quantity": 2.0,
      "unit": "cups",
      "item": "(455 g) lukewarm water, made by combining 1/2 cup boiling water with 1 1/2 cups cold water"
    },
    {
      "quantity": null,
      "unit": null,
      "item": "butter for greasing"
    },
    {
      "quantity": 4.0,
      "unit": "tablespoons",
      "item": "olive oil, divided"
    },
    {
      "quantity": null,
      "unit": null,
      "item": "flaky sea salt, such as Maldon"
    },
    {
      "quantity": 1.0,
      "unit": null,
      "item": "to 2 teaspoons whole rosemary leaves, optional"
    }
  ],
  "instructions": [
    "In a large bowl, whisk together the flour, salt, and instant yeast. Add the water. Using a rubber spatula, mix until the liquid is absorbed and the ingredients form a sticky dough ball. Cover the bowl, and let rest for 30 minutes, then stretch and fold the dough — this is an optional new step (9/17/2025), but if time permits, do it: I find it makes for an especially bubby focaccia. Fill a small bowl with water. Using a wet hand, grab an edge of the dough and pull it up and towards the center. Repeat this stretching and folding process, 8 to 10 times, moving your hand around the edge of the dough with every set of stretches and folds. As you stretch and fold, you should feel the dough transform from being sticky and shaggy to smooth and cohesive. Find video guidance here.",
    "Rub the surface of the dough lightly with olive oil. Cover the bowl with a lid (ideally) or plastic wrap and place in the refrigerator immediately for at least 12 hours or for as long as three days. (See notes above if you need to skip the overnight rise for time purposes.) NOTE: It is important the dough really be slicked with olive oil, especially if you are not using a hard lid. If you do not slick the dough with enough oil, you risk the dough drying out and forming a crust over the top layer.",
    "Line two 8- or 9-inch pie plates or a 9&#215;13-inch pan (see notes above) with parchment paper or grease with butter or coat with nonstick cooking spray. (Note: This greasing step may seem excessive, but with some pans, it is imperative to do so to prevent sticking. With my USA pans, I can get away with olive oil alone; with my glass baking dishes, butter is a must.)",
    "Pour a tablespoon of oil into the center of each pan or 2 tablespoons of oil if using the 9&#215;13-inch pan. Using two forks, deflate the dough by releasing it from the sides of the bowl and pulling it toward the center. Rotate the bowl in quarter turns as you deflate, turning the mass into a rough ball. Use the forks to split the dough into two equal pieces (or do not split if using the 9&#215;13-inch pan). Place one piece into one of the prepared pans. Roll the dough ball in the oil to coat it all over, forming a rough ball. Repeat with the remaining piece. Let the dough balls rest for 3 to 4 hours depending on the temperature of your kitchen (Note: no need to cover for this room temperature rise).",
    "Set a rack in the middle of the oven and preheat it to 425°F. If using the rosemary, sprinkle it over the dough. Pour a tablespoon of oil over each round of dough (or two tablespoons if using a 9&#215;13-inch pan).  Rub your hands lightly in the oil to coat, then, using all of your fingers, press straight down to create deep dimples. If necessary, gently stretch the dough as you dimple to allow the dough to fill the pan. Sprinkle with flaky sea salt all over.",
    "Transfer the pans or pan to the oven and bake for 25 to 30 minutes, until the underside is golden and crisp. Remove the pans or pan from the oven and transfer the focaccia to a cooling rack. Let it cool for 10 minutes before cutting and serving; let it cool completely if you are halving it with the intention of making a sandwich.",
    "When it has completely cooled, transfer it to an airtight bag or vessel and store it at room temperature for up to 3 days. Otherwise, freeze it for up to 3 months. Always reheat it on subsequent days to revive its crust: 350ºF for 15 minutes."
  ],
  "source_url": "https://alexandracooks.com/2018/03/02/overnight-refrigerator-focaccia-best-focaccia/"
}